# start 변수를 추가해 시작을 어디부터 할 지 결정
'''
문제
자연수 N과 M이 주어졌을 때, 아래 조건을 만족하는 길이가 M인 수열을 모두 구하는 프로그램을 작성하시오.

1부터 N까지 자연수 중에서 중복 없이 M개를 고른 수열
고른 수열은 오름차순이어야 한다.

입력
첫째 줄에 자연수 N과 M이 주어진다. (1 ≤ M ≤ N ≤ 8)

출력
한 줄에 하나씩 문제의 조건을 만족하는 수열을 출력한다. 
중복되는 수열을 여러 번 출력하면 안되며, 각 수열은 공백으로 구분해서 출력해야 한다.

수열은 사전 순으로 증가하는 순서로 출력해야 한다.

예제 입력 1 
3 1

예제 출력 1 
1
2
3

'''

n,m=map(int, input().split())
s=[]

def dfs(start):
    if len(s)==m:
        print(' '.join(map(str,s)))
        return

    # 길이를 충족시키지 못하고 자릿수가 더 늘어날 경우에 for문으로 넘어감
    for i in range(start,n+1):
#        if i not in s:
        s.append(i)
        dfs(i+1)
        s.pop()

dfs(1)




